app/views/posts/_form.html.erb

    <%= f.label :tag_ids, "Tags" %><br>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"